package com.qifenqian.bms.merchant.reported.enums;
/**
 * WECHANT企业费率ID编码
 * @author shili
 *
 */
public enum WeChatEntRateIdType {
	餐饮("716","餐饮"),
	食品生鲜("716","食品生鲜"),
	电信运营商宽带收费("716","电信运营商/宽带收费"),
	私立民营医院诊所("716","私立/民营医院/诊所"),
	保健器械医疗器械非处方药品("716","保健器械/医疗器械/非处方药品"),
	游艺厅KTV网吧("716","游艺厅/KTV/网吧"),
	机票机票代理("716","机票/机票代理"),
	宠物医院("716","宠物医院"),
	旅行社("716","旅行社"),
	宗教组织("716","宗教组织"),
	房地产房产中介("716","房地产/房产中介"),
	共享服务("716","共享服务"),
	文物经营文物复制品销售("716","文物经营/文物复制品销售"),
	拍卖典当("716","拍卖典当"),
	教育培训考试缴费学费("716","教育/培训/考试缴费/学费"),
	零售批发生活娱乐网上商城其他("716","零售批发/生活娱乐/网上商城/其他"),
	保险业务("715","保险业务"),
	众筹("714","众筹"),
	财经股票类资讯("713","财经/股票类资讯"),
	话费通讯("728","话费通讯"),
	婚介平台就业信息平台其他("728","婚介平台/就业信息平台/其他"),
	在线图书视频音乐网络直播("711","在线图书/视频/音乐/网络直播"),
	游戏("711","游戏"),
	门户论坛网络广告及推广软件开发其他("711","门户论坛/网络广告及推广/软件开发/其他"),
	物流快递("717","物流/快递"),
	加油("717","加油"),
	民办中小学及幼儿园("717","民办中小学及幼儿园"),
	公共事业水电煤气("730","公共事业（水电煤气）"),
	信用还款("718","信用还款"),
	民办大学及学院("739","民办大学及学院");
	
	private String code;
	private String name;
	WeChatEntRateIdType(String code,String name){
		this.code = code;
		this.name = name;
	}
	public String getName() {
		return name;
	}
	public void setName(String name) {
		this.name = name;
	}
	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}

}
